In [5]:
import pandas as pd
import pandas
from pandas import *

In [1]:
#Ejercicio 1

In [6]:
df1 = pd.DataFrame([(11111111, 25, 'H', 'Enric', 'Oller' ),
                   (11111112, 23,'M', 'Antonia', 'Vaquer'),
                    (11111113, 35,'M', 'Francisca', 'Vidal'),
                    (11111114, 44,'M', 'Maria', 'Barceló'),
                    (11111115, 19,'H', 'Josep', 'Oliver'),
                    (11111116, 22,'M', 'Aina', 'Mas'),
                    (11111117, 55,'M', 'Júlia', 'Pineda'),
                    (11111118, 60,'H', 'Jaume', 'Lliteres'),
                    (11111119, 29,'H', 'Jaume', 'Adrover'),
              ], 
           columns=('DNI', 'Edad', 'Sexo', 'Nombre', 'Apellidos')
                 )
df1

        DNI  Edad Sexo     Nombre Apellidos
0  11111111    25    H      Enric     Oller
1  11111112    23    M    Antonia    Vaquer
2  11111113    35    M  Francisca     Vidal
3  11111114    44    M      Maria   Barceló
4  11111115    19    H      Josep    Oliver
5  11111116    22    M       Aina       Mas
6  11111117    55    M      Júlia    Pineda
7  11111118    60    H      Jaume  Lliteres
8  11111119    29    H      Jaume   Adrover

In [14]:
df2 = pd.DataFrame([(11111111, 'GEIN', 8 , 'Sí' ),
                    (11111112, 'GMAT', 7, 'No' ),
                    (11111113, 'GEIN', 6, 'Sí' ),
                    (11111114, 'GEE', 5, 'Sí' ),
                    (11111116, 'GFIS', 5.5 , 'No' ),
                    (11111117,'GQUIM', 9 , 'Sí' ),
                    (11111118, 'GQUIM', 6.4 , 'No' ),
                    (11111119, 'GEE', 8.2 , 'Sí' ),
                    (11111114, 'GFIS' , 7.75 , 'No' ),
              ], 
           columns=('DNI', 'Estudios', 'Media', 'Acabado')
                 )
df2

        DNI Estudios  Media Acabado
0  11111111     GEIN   8.00      Sí
1  11111112     GMAT   7.00      No
2  11111113     GEIN   6.00      Sí
3  11111114      GEE   5.00      Sí
4  11111116     GFIS   5.50      No
5  11111117    GQUIM   9.00      Sí
6  11111118    GQUIM   6.40      No
7  11111119      GEE   8.20      Sí
8  11111114     GFIS   7.75      No

In [13]:
#Ejercicio 2

In [9]:
df1[df1["Edad"] > 30  ]

        DNI  Edad Sexo     Nombre Apellidos
2  11111113    35    M  Francisca     Vidal
3  11111114    44    M      Maria   Barceló
6  11111117    55    M      Júlia    Pineda
7  11111118    60    H      Jaume  Lliteres

In [ ]:
#Ejercicio 3

In [11]:
jaume = df1[df1["Nombre"]=="Jaume"]
jaume

        DNI  Edad Sexo Nombre Apellidos
7  11111118    60    H  Jaume  Lliteres
8  11111119    29    H  Jaume   Adrover

In [17]:
#Ejercicio 4

In [12]:
mujer = df1[df1["Sexo"]=="M"]
mujer

        DNI  Edad Sexo     Nombre Apellidos
1  11111112    23    M    Antonia    Vaquer
2  11111113    35    M  Francisca     Vidal
3  11111114    44    M      Maria   Barceló
5  11111116    22    M       Aina       Mas
6  11111117    55    M      Júlia    Pineda

In [ ]:
#Ejercicio 5

In [15]:
df3=df1.merge(df2, left_on='DNI', right_on='DNI',how="left")
df3

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media Acabado
0  11111111    25    H      Enric     Oller     GEIN   8.00      Sí
1  11111112    23    M    Antonia    Vaquer     GMAT   7.00      No
2  11111113    35    M  Francisca     Vidal     GEIN   6.00      Sí
3  11111114    44    M      Maria   Barceló      GEE   5.00      Sí
4  11111114    44    M      Maria   Barceló     GFIS   7.75      No
5  11111115    19    H      Josep    Oliver      NaN    NaN     NaN
6  11111116    22    M       Aina       Mas     GFIS   5.50      No
7  11111117    55    M      Júlia    Pineda    GQUIM   9.00      Sí
8  11111118    60    H      Jaume  Lliteres    GQUIM   6.40      No
9  11111119    29    H      Jaume   Adrover      GEE   8.20      Sí

In [50]:
#Ejercicio 6, se que no esta correcto pero entendia lo que habia que hacer pero no sabia la funciòn

In [16]:
df4= df3 ['Acabado'] == 'Sí' 
df4

0     True
1    False
2     True
3     True
4    False
5    False
6    False
7     True
8    False
9     True
Name: Acabado, dtype: bool

In [17]:
df3["Acabado"] =df3["Acabado"]=='Si'

In [84]:
df3.insert(loc=7, column="Acabado1", value=['True', 'False', 'True', 'True', 'False', 'False', 'False', 'True', 'False', 'True']) # agrega una columna en determinado lugar con el nombre "" y los valores por fila X
df3

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media Acabado1 Acabado
0  11111111    25    H      Enric     Oller     GEIN   8.00     True      Sí
1  11111112    23    M    Antonia    Vaquer     GMAT   7.00    False      No
2  11111113    35    M  Francisca     Vidal     GEIN   6.00     True      Sí
3  11111114    44    M      Maria   Barceló      GEE   5.00     True      Sí
4  11111114    44    M      Maria   Barceló     GFIS   7.75    False      No
5  11111115    19    H      Josep    Oliver      NaN    NaN    False     NaN
6  11111116    22    M       Aina       Mas     GFIS   5.50    False      No
7  11111117    55    M      Júlia    Pineda    GQUIM   9.00     True      Sí
8  11111118    60    H      Jaume  Lliteres    GQUIM   6.40    False      No
9  11111119    29    H      Jaume   Adrover      GEE   8.20     True      Sí

In [51]:
#Ejercicio 7

In [ ]:
#Ejercicio 8

In [56]:
df5= df2[df2["Acabado"]=="Sí"]
df5

        DNI Estudios  Media Acabado
0  11111111     GEIN    8.0      Sí
2  11111113     GEIN    6.0      Sí
3  11111114      GEE    5.0      Sí
5  11111117    GQUIM    9.0      Sí
7  11111119      GEE    8.2      Sí

In [ ]:
#Ejercicio 9

In [ ]:
#Ejericio 10

In [70]:
import funciones

In [ ]:
#Funciòn.py Solo cree el archivo

In [74]:
df=pd.DataFrame( {"Media": [2,3,5,6]}) #construyo un df de una columna
df

   Media
0      2
1      3
2      5
3      6